<h1 style="text-align: center;">Experiment 2</h1>

<h4> Aim : To perform creating and accessing DataVector, MathsOperations, DataFramecreation,
reading & writing, Handling DataFrame using Pandas and Numpy.</h4>

In [1]:
# DATA VECTORS
# NUMPY - Numerical Python
# NUMPY is a library for the Python programming language, adding support for large, multi-dimensional arrays and matrices, along with a large collection of high-level mathematical functions to operate on these arrays.

In [2]:
import numpy as np
import pandas as pd

In [3]:
ds = pd.Series([10,20,30])
ds

0    10
1    20
2    30
dtype: int64

In [4]:
ds[0]

10

In [5]:
ds = pd.Series([10,20,30], index=['a','b','c'])

In [6]:
ds

a    10
b    20
c    30
dtype: int64

In [7]:

ds["b"]

20

In [8]:
ds[ds>20]

c    30
dtype: int64

In [9]:
ds[ds==10]

a    10
dtype: int64

In [10]:
df = pd.DataFrame(([10,20,30],[40,50,60]),columns=['A','B','C'],dtype=int)
df

    A   B   C
0  10  20  30
1  40  50  60

In [11]:
df.A

0    10
1    40
Name: A, dtype: int32

In [12]:
dict = { "name":['A','B','C'] , "age" : [20,30,40]}
dict

{'name': ['A', 'B', 'C'], 'age': [20, 30, 40]}

In [13]:
df = pd.DataFrame(dict)
df

  name  age
0    A   20
1    B   30
2    C   40

In [14]:
df['weight']=[60,90,100]
df

  name  age  weight
0    A   20      60
1    B   30      90
2    C   40     100

In [15]:
df.iloc[:1, 1:]

   age  weight
0   20      60

## Data Preprocessing

In [16]:
df  = pd.read_csv("Housing.csv")

In [17]:
df

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [18]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [19]:
df.tail()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [20]:
df.isnull().sum()

price               0
area                0
bedrooms            0
bathrooms           0
stories             0
mainroad            0
guestroom           0
basement            0
hotwaterheating     0
airconditioning     0
parking             0
prefarea            0
furnishingstatus    0
dtype: int64

In [21]:
df=df.ffill()

In [22]:
df.isnull().sum()

price               0
area                0
bedrooms            0
bathrooms           0
stories             0
mainroad            0
guestroom           0
basement            0
hotwaterheating     0
airconditioning     0
parking             0
prefarea            0
furnishingstatus    0
dtype: int64

## v'=[(v-min)/(max-min)]*(new_max-new_min) + new_min  (MIN-MAX SCALER)

In [23]:
df =df.iloc[ : ,0:5]

In [24]:
df

        price  area  bedrooms  bathrooms  stories
0    13300000  7420         4          2        3
1    12250000  8960         4          4        4
2    12250000  9960         3          2        2
3    12215000  7500         4          2        2
4    11410000  7420         4          1        2
..        ...   ...       ...        ...      ...
540   1820000  3000         2          1        1
541   1767150  2400         3          1        1
542   1750000  3620         2          1        1
543   1750000  2910         3          1        1
544   1750000  3850         3          1        2

[545 rows x 5 columns]

In [25]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
scaled_values = scaler.fit_transform(df)
scaled_df = pd.DataFrame(scaled_values, columns=df.columns)

In [26]:
scaled_df

        price      area  bedrooms  bathrooms   stories
0    1.000000  0.396564       0.6   0.333333  0.666667
1    0.909091  0.502405       0.6   1.000000  1.000000
2    0.909091  0.571134       0.4   0.333333  0.333333
3    0.906061  0.402062       0.6   0.333333  0.333333
4    0.836364  0.396564       0.6   0.000000  0.333333
..        ...       ...       ...        ...       ...
540  0.006061  0.092784       0.2   0.000000  0.000000
541  0.001485  0.051546       0.4   0.000000  0.000000
542  0.000000  0.135395       0.2   0.000000  0.000000
543  0.000000  0.086598       0.4   0.000000  0.000000
544  0.000000  0.151203       0.4   0.000000  0.333333

[545 rows x 5 columns]

## Z-score (x-mean)/standard_deviation

In [27]:
(df-np.mean(df))/np.std(df)

C:\Users\Mihir\AppData\Local\Programs\Python\Python312\Lib\site-packages\numpy\core\fromnumeric.py:3643: FutureWarning: The behavior of DataFrame.std with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

        price        area      bedrooms     bathrooms       stories
0    6.606449 -436.758314 -1.294265e+06 -1.901114e+06 -1.101163e+06
1    6.044568 -436.048031 -1.294265e+06 -1.901110e+06 -1.101162e+06
2    6.044568 -435.586808 -1.294266e+06 -1.901114e+06 -1.101165e+06
3    6.025839 -436.721416 -1.294265e+06 -1.901114e+06 -1.101165e+06
4    5.595063 -436.758314 -1.294265e+06 -1.901116e+06 -1.101165e+06
..        ...         ...           ...           ...           ...
540  0.463216 -438.796919 -1.294267e+06 -1.901116e+06 -1.101166e+06
541  0.434935 -439.073653 -1.294266e+06 -1.901116e+06 -1.101166e+06
542  0.425758 -438.510961 -1.294267e+06 -1.901116e+06 -1.101166e+06
543  0.425758 -438.838429 -1.294266e+06 -1.901116e+06 -1.101166e+06
544  0.425758 -438.404880 -1.294266e+06 -1.901116e+06 -1.101165e+06

[545 rows x 5 columns]

In [28]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
normalized_data = scaler.fit_transform(df)
df_normalized = pd.DataFrame(normalized_data, columns=df.columns)
print(df_normalized)

        price      area  bedrooms  bathrooms   stories
0    4.566365  1.046726  1.403419   1.421812  1.378217
1    4.004484  1.757010  1.403419   5.405809  2.532024
2    4.004484  2.218232  0.047278   1.421812  0.224410
3    3.985755  1.083624  1.403419   1.421812  0.224410
4    3.554979  1.046726  1.403419  -0.570187  0.224410
..        ...       ...       ...        ...       ...
540 -1.576868 -0.991879 -1.308863  -0.570187 -0.929397
541 -1.605149 -1.268613  0.047278  -0.570187 -0.929397
542 -1.614327 -0.705921 -1.308863  -0.570187 -0.929397
543 -1.614327 -1.033389  0.047278  -0.570187 -0.929397
544 -1.614327 -0.599839  0.047278  -0.570187  0.224410

[545 rows x 5 columns]

In [29]:
np.mean(df_normalized)

-5.214992556037433e-17

In [30]:
np.std(df_normalized, axis=0)

price        1.0
area         1.0
bedrooms     1.0
bathrooms    1.0
stories      1.0
dtype: float64